In [1]:
import pandas as pd
import numpy as np

In [2]:
# Create Data
stuff = {'Corporations':['Apple','Google','Meta','Apple','Google','Meta']
         ,'Employees':['Marie','Zagreus','Melissa','Fedosev','Saun','Jokeph']
         ,'Salary':[200,220,190,130,120,150]}
# Create Dataframe
my_df = pd.DataFrame(stuff)
my_df

  Corporations Employees  Salary
0        Apple     Marie     200
1       Google   Zagreus     220
2         Meta   Melissa     190
3        Apple   Fedosev     130
4       Google      Saun     120
5         Meta    Jokeph     150

In [3]:
# Create Funtion
def times1000(x):
    return format(x*1000,',d')

In [4]:
# Apply Funtion
my_df['Salary'].apply(times1000)

0    200,000
1    220,000
2    190,000
3    130,000
4    120,000
5    150,000
Name: Salary, dtype: object

In [5]:
# Append to current DF
my_df['Salary'] = my_df['Salary'].apply(times1000)
my_df

  Corporations Employees   Salary
0        Apple     Marie  200,000
1       Google   Zagreus  220,000
2         Meta   Melissa  190,000
3        Apple   Fedosev  130,000
4       Google      Saun  120,000
5         Meta    Jokeph  150,000

In [6]:
# Funtions on Multiple Columns
def namer(x):
    return 'Learning : ' + x

In [7]:
# Apply to multiple Columns
my_df[['Corporations','Employees']].apply(namer)

        Corporations           Employees
0   Learning : Apple    Learning : Marie
1  Learning : Google  Learning : Zagreus
2    Learning : Meta  Learning : Melissa
3   Learning : Apple  Learning : Fedosev
4  Learning : Google     Learning : Saun
5    Learning : Meta   Learning : Jokeph

In [8]:
# Append to current Dataframe
my_df[['Corporations','Employees']] = my_df[['Corporations','Employees']].apply(namer)
my_df

        Corporations           Employees   Salary
0   Learning : Apple    Learning : Marie  200,000
1  Learning : Google  Learning : Zagreus  220,000
2    Learning : Meta  Learning : Melissa  190,000
3   Learning : Apple  Learning : Fedosev  130,000
4  Learning : Google     Learning : Saun  120,000
5    Learning : Meta   Learning : Jokeph  150,000